src/cf/DataProcessors/ор_ВыгрузкаФГИС_ЕИАС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ор_ВыгрузкаФГИС_ЕИАС</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБезСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Себестоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СебестоимостьБезНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоИнт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаИнт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДСИнт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБезСкидкиИнт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СебестоимостьИнт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СебестоимостьБезНДСИнт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>эв_ИБ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>эв_КБ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходнаяНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.ЧекККМВозврат</v8:Type>
						<v8:Type>cfg:DocumentRef.АктВыполненныхРабот</v8:Type>
						<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОПереработке</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитенту</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаТоваровМеждуОрганизациями</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатураНабора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНабора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДвижениеЧекаВОткрытойСмене</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ор_РеестрЦенПроизводителейНаЖНВЛП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ор_РеестрЦенПроизводителейНаЖНВЛП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ор_Производители</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФормаВыпускаПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоВУпаковке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОптоваяНаценка</Name>
					<Comment>Оптовая наценка (не используется)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РозничнаяНаценка</Name>
					<Comment>Розничная наценка (не используется)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерВыписки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Это1СНоменклатура</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ШтрихКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаименованиеПроизводителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФормаВыпускаКраткое</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдРЛС</Name>
					<Comment>ID РЛС</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаРегистрацииЦены</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/DataProcessors/ор_ВыгрузкаФГИС_ЕИАС/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РежимВыгрузки = "Все ЖНВЛП";
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПараметры;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьСостояниеКнопокСтраницы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОповещениеВыбораФайла = Новый ОписаниеОповещения("ИмяФайлаНачалоВыбора_Завершение", ЭтотОбъект);
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.ПолноеИмяФайла = ИмяФайла;
	ДиалогВыбораФайла.Фильтр         = НСтр("ru='Файлы MS Excel'; en='MS Excel files'") + "(*.xls)|*.xls";
	ДиалогВыбораФайла.Показать(ОповещениеВыбораФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРезультатСтоимостьПриобрПриИзменении(Элемент)
	РассчитатьВаловуюПрибыльПланВСтроке(Элементы.ТаблицаРезультат.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРезультатСтоимостьРеализПриИзменении(Элемент)
	РассчитатьВаловуюПрибыльПланВСтроке(Элементы.ТаблицаРезультат.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРезультатКоличествоПриИзменении(Элемент)
	РассчитатьВаловуюПрибыльПланВСтроке(Элементы.ТаблицаРезультат.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРезультатКоличествоПланПриИзменении(Элемент)
	РассчитатьВаловуюПрибыльПланВСтроке(Элементы.ТаблицаРезультат.ТекущиеДанные);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Далее(Команда)
	СменитьСтраницу(Истина);
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	СменитьСтраницу(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)
	
	Если НЕ ЗначениеЗаполнено(ИмяФайла) Тогда
		ТекстСообщения = НСтр("ru='Имя файла не заполнено.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Состояние(НСтр("ru='Сохранение отчета в файл...'"));
	ЗаполнитьТабличныйДокументРезультат();
	Результат.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.XLS);
	
	Состояние(НСтр("ru='Окончательная обработка файла...'"));
	ExcelДокумент = ОткрытьExcelДокумент();
	Если ExcelДокумент = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("ru='Не удалось открыть Excel, необходимо вручную в файле импорта переименовать лист с TDSheet на ЛС.'"));
		Возврат;
	КонецЕсли;
	
	КнигаExcelДокумент = ExcelДокумент.Workbooks.Open(ИмяФайла);
	ЛистExcelДокумент  = КнигаExcelДокумент.Sheets(1);
	ЛистExcelДокумент.Name = "ЛС";
	КнигаExcelДокумент.SaveAs(ИмяФайла, -4143);
	КнигаExcelДокумент.Close();
	ExcelДокумент.Quit();
	ПоказатьПредупреждение(,НСтр("ru='Файл выгружен успешно.'"));
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетПланаДляВсех(Команда)
	ЗаполнитьПлановоеКоличество(Истина);
КонецПроцедуры

&НаКлиенте
Процедура РасчетПланаДляВыделенных(Команда)
	ЗаполнитьПлановоеКоличество(Ложь);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ИмяФайлаНачалоВыбора_Завершение(Результат, ДопПараметры = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяФайла = Результат[0];
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборКоэффициента_Завершение(Результат, ДопПараметры = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПлановоеКоличествоЗавершение(Результат, ДопПараметры.ДляВсех);
	
КонецПроцедуры

&НаКлиенте
Процедура СменитьСтраницу(Вперед)
	
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПараметры Тогда
		
		Если Вперед Тогда
			
			ЕстьОшибки = Ложь;
			Если НЕ ЗначениеЗаполнено(Организация) Тогда
				ЕстьОшибки = Истина;
				ТекстСообщения = НСтр("ru='Поле ""Организация"" не заполнено.'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"Организация","ЭтотОбъект");
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(Период) Тогда
				ЕстьОшибки = Истина;
				ТекстСообщения = НСтр("ru='Поле ""Период"" не заполнено.'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"Период","ЭтотОбъект");
			КонецЕсли;
			
			Если НЕ ЕстьОшибки Тогда
				ЗаполнитьДанные();
				Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаРезультат;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаРезультат Тогда
		
		Если Вперед Тогда
			
			ЕстьОшибки = Ложь;
			// проверка заполнения данных
			ВыполнитьПроверкуЗаполнения(ЕстьОшибки);
			Если НЕ ЕстьОшибки Тогда
				Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаВыгрузка;
			КонецЕсли;
			
		Иначе
			Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПараметры;
		КонецЕсли;
		
	Иначе
		
		Если Не Вперед Тогда
			Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаРезультат;
		КонецЕсли;
		
	КонецЕсли;
	
	ОбновитьСостояниеКнопокСтраницы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСостояниеКнопокСтраницы()
	
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПараметры Тогда
		
		Элементы.ФормаНазад.Доступность   = Ложь;
		Элементы.ФормаДалее.Доступность   = Истина;
		Элементы.ФормаВыгрузить.Видимость = Ложь;
		
		Элементы.ДекорацияЗаголовок.Заголовок = НСтр("ru='Шаг 1: Заполнение параметров выгрузки'");
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаРезультат Тогда
		
		Элементы.ФормаНазад.Доступность   = Истина;
		Элементы.ФормаДалее.Доступность   = Истина;
		Элементы.ФормаВыгрузить.Видимость = Ложь;
		
		Элементы.ДекорацияЗаголовок.Заголовок = НСтр("ru='Шаг 2: Результат выгрузки'");
		
	Иначе
		
		Элементы.ФормаНазад.Доступность   = Истина;
		Элементы.ФормаДалее.Доступность   = Ложь;
		Элементы.ФормаВыгрузить.Видимость = Истина;
		
		Элементы.ДекорацияЗаголовок.Заголовок = НСтр("ru='Шаг 3: Завершение выгрузки'");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанные()
	
	Результат.Очистить();
	ТаблицаРезультат.Очистить();
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Продажи.Номенклатура КАК Номенклатура,
	|	Продажи.Характеристика КАК Характеристика,
	|	СУММА(Продажи.КоличествоОборот) КАК Количество,
	|	СУММА(ВЫБОР
	|			КОГДА &ВыводитьЦенуПриобритенияСНДС
	|				ТОГДА Продажи.СуммаОборот
	|			ИНАЧЕ ВЫБОР
	|					КОГДА Продажи.Документ.НДСВключатьВСтоимость
	|						ТОГДА Продажи.СуммаОборот - Продажи.СуммаНДСОборот
	|					ИНАЧЕ Продажи.СуммаОборот
	|				КОНЕЦ
	|		КОНЕЦ) КАК Сумма
	|ПОМЕСТИТЬ втПродажи
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(&НачалоПродаж, &КонецПродаж, , Документ.Организация = &Организация) КАК Продажи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК спрНоменклатура
	|		ПО Продажи.Номенклатура = спрНоменклатура.Ссылка
	|ГДЕ
	|	спрНоменклатура.ор_ЖНВЛС
	|	И &РежимВыгрузки
	|
	|СГРУППИРОВАТЬ ПО
	|	Продажи.Номенклатура,
	|	Продажи.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ор_РеестрЦенПроизводителейНаЖНВЛП.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(ор_РеестрЦенПроизводителейНаЖНВЛП.ДатаРегистрацииЦены) КАК ДатаРегистрацииЦены
	|ПОМЕСТИТЬ ДатыРеестраЦен
	|ИЗ
	|	РегистрСведений.ор_РеестрЦенПроизводителейНаЖНВЛП КАК ор_РеестрЦенПроизводителейНаЖНВЛП
	|ГДЕ
	|	ор_РеестрЦенПроизводителейНаЖНВЛП.Номенклатура В
	|			(ВЫБРАТЬ
	|				втПродажи.Номенклатура КАК Номенклатура
	|			ИЗ
	|				втПродажи КАК втПродажи)
	|	И ор_РеестрЦенПроизводителейНаЖНВЛП.ДатаРегистрацииЦены <= &КонецПродаж
	|
	|СГРУППИРОВАТЬ ПО
	|	ор_РеестрЦенПроизводителейНаЖНВЛП.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДатыРеестраЦен.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(ЕСТЬNULL(ор_РеестрЦенПроизводителейНаЖНВЛП.Цена, 0)) КАК ЦенаЖНВЛП
	|ПОМЕСТИТЬ РеестрЦен
	|ИЗ
	|	ДатыРеестраЦен КАК ДатыРеестраЦен
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ор_РеестрЦенПроизводителейНаЖНВЛП КАК ор_РеестрЦенПроизводителейНаЖНВЛП
	|		ПО ДатыРеестраЦен.Номенклатура = ор_РеестрЦенПроизводителейНаЖНВЛП.Номенклатура
	|			И ДатыРеестраЦен.ДатаРегистрацииЦены = ор_РеестрЦенПроизводителейНаЖНВЛП.ДатаРегистрацииЦены
	|
	|СГРУППИРОВАТЬ ПО
	|	ДатыРеестраЦен.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втПродажи.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ЕСТЬNULL(Штрихкоды1.Штрихкод, """") <> """"
	|				ТОГДА ЕСТЬNULL(Штрихкоды1.Штрихкод, """")
	|			ИНАЧЕ ЕСТЬNULL(Штрихкоды.Штрихкод, """")
	|		КОНЕЦ) КАК Штрихкод
	|ПОМЕСТИТЬ втШтрихкоды
	|ИЗ
	|	втПродажи КАК втПродажи
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК Штрихкоды
	|		ПО втПродажи.Номенклатура = Штрихкоды.Номенклатура
	|			И втПродажи.Характеристика = Штрихкоды.Характеристика
	|			И (Штрихкоды.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка))
	|			И (НЕ Штрихкоды.Штрихкод ПОДОБНО ""2%"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК Штрихкоды1
	|		ПО втПродажи.Номенклатура = Штрихкоды1.Номенклатура
	|			И (Штрихкоды1.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
	|			И (Штрихкоды1.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка))
	|			И (НЕ Штрихкоды1.Штрихкод ПОДОБНО ""2%"")
	|
	|СГРУППИРОВАТЬ ПО
	|	втПродажи.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПродажи.Номенклатура КАК Номенклатура,
	|	втПродажи.Характеристика КАК Характеристика,
	|	втПродажи.Количество КАК Количество,
	|	МАКСИМУМ(ПриходнаяНакладнаяЗапасы.Ссылка.Дата) КАК ДатаПоступления
	|ПОМЕСТИТЬ врПоступления1
	|ИЗ
	|	втПродажи КАК втПродажи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриходнаяНакладная.Запасы КАК ПриходнаяНакладнаяЗапасы
	|		ПО втПродажи.Номенклатура = ПриходнаяНакладнаяЗапасы.Номенклатура
	|			И втПродажи.Характеристика = ПриходнаяНакладнаяЗапасы.Характеристика
	|ГДЕ
	|	ПриходнаяНакладнаяЗапасы.Ссылка.Проведен
	|	И ПриходнаяНакладнаяЗапасы.Ссылка.Дата >= &НачалоПродаж
	|	И ПриходнаяНакладнаяЗапасы.Ссылка.Дата <= &КонецПродаж
	|
	|СГРУППИРОВАТЬ ПО
	|	втПродажи.Номенклатура,
	|	втПродажи.Характеристика,
	|	втПродажи.Количество
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	врПоступления1.Номенклатура КАК Номенклатура,
	|	врПоступления1.Характеристика КАК Характеристика,
	|	врПоступления1.Количество КАК Количество,
	|	ПриходнаяНакладнаяЗапасы.Ссылка КАК ПоступлениеТоваров
	|ПОМЕСТИТЬ врПоступления2
	|ИЗ
	|	врПоступления1 КАК врПоступления1
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриходнаяНакладная.Запасы КАК ПриходнаяНакладнаяЗапасы
	|		ПО врПоступления1.Номенклатура = ПриходнаяНакладнаяЗапасы.Номенклатура
	|			И врПоступления1.Характеристика = ПриходнаяНакладнаяЗапасы.Характеристика
	|			И врПоступления1.ДатаПоступления = ПриходнаяНакладнаяЗапасы.Ссылка.Дата
	|ГДЕ
	|	ПриходнаяНакладнаяЗапасы.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	врПоступления1.Номенклатура,
	|	врПоступления1.Характеристика,
	|	врПоступления1.Количество,
	|	ПриходнаяНакладнаяЗапасы.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	врПоступления2.Номенклатура КАК Номенклатура,
	|	врПоступления2.Характеристика КАК Характеристика,
	|	СУММА(ВЫБОР
	|			КОГДА &ВыводитьЦенуПроизводителяСНДС
	|				ТОГДА ВЫБОР
	|						КОГДА НЕ &ЦенаПроизводителяСНДС
	|							ТОГДА ПоступлениеТоваровТовары.ор_ЦенаПроизводителя + (ВЫРАЗИТЬ(ПоступлениеТоваровТовары.СтавкаНДС.Ставка * ПоступлениеТоваровТовары.ор_ЦенаПроизводителя / 100 КАК ЧИСЛО(15, 2)))
	|						ИНАЧЕ ПоступлениеТоваровТовары.ор_ЦенаПроизводителя
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА &ЦенаПроизводителяСНДС
	|						ТОГДА ПоступлениеТоваровТовары.ор_ЦенаПроизводителя - (ВЫРАЗИТЬ(ПоступлениеТоваровТовары.СтавкаНДС.Ставка * ПоступлениеТоваровТовары.ор_ЦенаПроизводителя / (100 + ПоступлениеТоваровТовары.СтавкаНДС.Ставка) КАК ЧИСЛО(15, 2)))
	|					ИНАЧЕ ПоступлениеТоваровТовары.ор_ЦенаПроизводителя
	|				КОНЕЦ
	|		КОНЕЦ * врПоступления2.Количество) КАК СуммаПроизводителя,
	|	СУММА(ВЫБОР
	|			КОГДА &ВыводитьЦенуПриобритенияСНДС
	|				ТОГДА ВЫБОР
	|						КОГДА НЕ ПоступлениеТоваровТовары.Ссылка.НДСВключатьВСтоимость
	|							ТОГДА ПоступлениеТоваровТовары.Цена + (ВЫРАЗИТЬ(ПоступлениеТоваровТовары.СтавкаНДС.Ставка * ПоступлениеТоваровТовары.Цена / 100 КАК ЧИСЛО(15, 2)))
	|						ИНАЧЕ ПоступлениеТоваровТовары.Цена
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ПоступлениеТоваровТовары.Ссылка.НДСВключатьВСтоимость
	|						ТОГДА ПоступлениеТоваровТовары.Цена - (ВЫРАЗИТЬ(ПоступлениеТоваровТовары.СтавкаНДС.Ставка * ПоступлениеТоваровТовары.Цена / (100 + ПоступлениеТоваровТовары.СтавкаНДС.Ставка) КАК ЧИСЛО(15, 2)))
	|					ИНАЧЕ ПоступлениеТоваровТовары.Цена
	|				КОНЕЦ
	|		КОНЕЦ * врПоступления2.Количество) КАК СуммаПоставщика
	|ПОМЕСТИТЬ втПоступления
	|ИЗ
	|	врПоступления2 КАК врПоступления2
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриходнаяНакладная.Запасы КАК ПоступлениеТоваровТовары
	|		ПО врПоступления2.Номенклатура = ПоступлениеТоваровТовары.Номенклатура
	|			И врПоступления2.Характеристика = ПоступлениеТоваровТовары.Характеристика
	|			И врПоступления2.ПоступлениеТоваров = ПоступлениеТоваровТовары.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	врПоступления2.Номенклатура,
	|	врПоступления2.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПродажи.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(втШтрихкоды.Штрихкод, """") КАК Штрихкод,
	|	СУММА(ЕСТЬNULL(втПродажи.Количество, 0) / 1000) КАК Количество,
	|	СУММА(ЕСТЬNULL(втПоступления.СуммаПоставщика, 0) / 1000) КАК СтоимостьПриобр,
	|	СУММА(ЕСТЬNULL(втПродажи.Сумма, 0) / 1000) КАК СтоимостьРеализ,
	|	СУММА(ЕСТЬNULL(втПоступления.СуммаПроизводителя, 0) / 1000) КАК СтоимостьВЦенахПроизв,
	|	ЕСТЬNULL(РеестрЦен.ЦенаЖНВЛП, 0) КАК ПредельнаяЦенаПроизв
	|ИЗ
	|	втПродажи КАК втПродажи
	|		ЛЕВОЕ СОЕДИНЕНИЕ втШтрихкоды КАК втШтрихкоды
	|		ПО втПродажи.Номенклатура = втШтрихкоды.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПоступления КАК втПоступления
	|		ПО втПродажи.Номенклатура = втПоступления.Номенклатура
	|			И втПродажи.Характеристика = втПоступления.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ РеестрЦен КАК РеестрЦен
	|		ПО втПродажи.Номенклатура = РеестрЦен.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	втПродажи.Номенклатура,
	|	ЕСТЬNULL(втШтрихкоды.Штрихкод, """"),
	|	ЕСТЬNULL(РеестрЦен.ЦенаЖНВЛП, 0)
	|
	|УПОРЯДОЧИТЬ ПО
	|	втПродажи.Номенклатура.Наименование";
	
	Если РежимВыгрузки = "Все ЖНВЛП" ИЛИ РежимВыгрузки = "" Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&РежимВыгрузки", "Истина");
	ИначеЕсли РежимВыгрузки = "ЖНВЛП, являющиеся наркотическими средствами" Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&РежимВыгрузки", "спрНоменклатура.ор_НаркотическоеСредство");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&РежимВыгрузки", "НЕ спрНоменклатура.ор_НаркотическоеСредство");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация"                   , Организация);
	Запрос.УстановитьПараметр("НачалоПродаж"                  , Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПродаж"                   , Период.ДатаОкончания);
	Запрос.УстановитьПараметр("ВыводитьЦенуПроизводителяСНДС" , ВыводитьЦенуПроизводителяСНДС);
	Запрос.УстановитьПараметр("ВыводитьЦенуПриобритенияСНДС"  , ВыводитьЦенуПриобритенияСНДС);
	Запрос.УстановитьПараметр("ЦенаПроизводителяСНДС"         , Справочники.ВидыЦен.ЦенаПроизводителя.ЦенаВключаетНДС);
	Запрос.УстановитьПараметр("КоэффициентПлана"              , КоэффициентРасчетаПланаПродаж);
	ЗАпрос.Текст = ТекстЗапроса;
	
	ТаблицаРезультат.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Функция ОткрытьExcelДокумент() Экспорт
	
	Попытка
		ExcelAp = Новый COMОбъект("Excel.Application");
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	// Просим Excel не обновлять экран и не отображать свои предупреждения в соответствии с параметрами.
	ExcelAp.Application.AskToUpdateLinks = 0;
	ExcelAp.Application.ScreenUpdating   = 0;
	ExcelAp.Application.DisplayAlerts    = 0;
	Возврат ExcelAp;
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьПроверкуЗаполнения(ЕстьОшибки)
	
	НеЗаполненШК = Ложь;
	НеЗаполненоКоличество = Ложь;
	НеЗаполненаСтоимостьПриобретения = Ложь;
	НеЗаполненаСтоимостьРеализации = Ложь;
	
	Для Каждого Строка Из ТаблицаРезультат Цикл
		
		Если Не НеЗаполненШК И Не ЗначениеЗаполнено(Строка.Штрихкод) Тогда
			НеЗаполненШК = Истина;
		КонецЕсли;
		
		Если Не НеЗаполненоКоличество И Не ЗначениеЗаполнено(Строка.Количество) Тогда
			НеЗаполненоКоличество = Истина;
		КонецЕсли;
		
		Если Не НеЗаполненаСтоимостьПриобретения И Не ЗначениеЗаполнено(Строка.СтоимостьПриобр) Тогда
			НеЗаполненаСтоимостьПриобретения = Истина;
		КонецЕсли;
		
		Если Не НеЗаполненаСтоимостьРеализации И Не ЗначениеЗаполнено(Строка.СтоимостьРеализ) Тогда
			НеЗаполненаСтоимостьРеализации = Истина;
		КонецЕсли;
		
		Если НеЗаполненШК И НеЗаполненоКоличество И НеЗаполненаСтоимостьПриобретения И НеЗаполненаСтоимостьРеализации Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если НеЗаполненШК Тогда
		ТекстСообщения = НСтр("ru='Не во всех строках заполнен штрихкод номенклатуры. Необходимо заполнить штрихкод.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Если НеЗаполненоКоличество Тогда
		ТекстСообщения = НСтр("ru='Не во всех строках заполнено количество. Необходимо заполнить количество.'");
		ТекстСообщения = ТекстСообщения + Символы.ПС;
		ТекстСообщения = ТекстСообщения + НСтр("ru='Возможно, что за выбранный период было продано товара меньше единицы.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Если НеЗаполненаСтоимостьПриобретения Тогда
		ТекстСообщения = НСтр("ru='Не во всех строках заполнена стоимость приобритения. Необходимо заполнить стоимость приобритения.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Если НеЗаполненаСтоимостьРеализации Тогда
		ТекстСообщения = НСтр("ru='Не во всех строках заполнена стоимость реализации. Необходимо заполнить стоимость реализации.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		ЕстьОшибки = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабличныйДокументРезультат()
	
	Макет = Обработки.ор_ВыгрузкаФГИС_ЕИАС.ПолучитьМакет("Макет");
	
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	Результат.Вывести(ОбластьШапка);
	
	Для Каждого Строка Из ТаблицаРезультат Цикл
		ОбластьСтрока = Макет.ПолучитьОбласть("ОбластьСтрока");
		ОбластьСтрока.Параметры.Заполнить(Строка);
		Результат.Вывести(ОбластьСтрока);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПлановоеКоличество(ДляВсех)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ДляВсех", ДляВсех);
	
	ОповещениеВводаКоэффициента = Новый ОписаниеОповещения("ВыборКоэффициента_Завершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ПоказатьВводЧисла(ОповещениеВводаКоэффициента,, НСтр("ru='Введите коэффициент'"), 10, 2)
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПлановоеКоличествоЗавершение(Коэффициент, ДляВсех)
	
	Если ДляВсех Тогда
		
		Для Каждого Строка Из ТаблицаРезультат Цикл
			
			Строка.КоличествоПлан = Строка.Количество * Коэффициент;
			
			РассчитатьВаловуюПрибыльПланВСтроке(Строка);
			
		КонецЦикла;
		
	Иначе
		
		ТекСтроки = Элементы.ТаблицаРезультат.ВыделенныеСтроки;
		
		Для Каждого ТекСтрока Из ТекСтроки Цикл
			
			Строка = ТаблицаРезультат.НайтиПоИдентификатору(ТекСтрока);
			
			Если Строка = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Строка.КоличествоПлан = Строка.Количество * Коэффициент;
			
			РассчитатьВаловуюПрибыльПланВСтроке(Строка);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьВаловуюПрибыльПланВСтроке(Строка)
	
	Если Строка.Количество = 0 или Строка.КоличествоПлан = 0 Тогда
		Строка.ВаловаяПрибыльПлан = 0;
	Иначе
		Строка.ВаловаяПрибыльПлан = (Строка.СтоимостьРеализ - Строка.СтоимостьПриобр) / Строка.Количество * Строка.КоличествоПлан;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Возврат;
	КонецЕсли;
	
	НалогообложениеНДС = НалогиУНФ.НалогообложениеНДС(Организация);
	
	Если НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС Тогда
		ПрименяетсяНДС = Истина;
	Иначе
		ПрименяетсяНДС = Ложь;
	КонецЕсли;
		
	ВыводитьЦенуПриобритенияСНДС = НЕ ПрименяетсяНДС;
	
КонецПроцедуры

#КонецОбласти
